
{
  "title":"Lecture Notes",
  "content":"Along with the complete set of lecture notes, the following readings were assigned in the class:\nSutton, George, and Oscar Biblarz. Rocket Propulsion Elements. New York, NY: Wiley-Interscience, 2000. ISBN: 0471326429.\nHill, Philip and Carl Peterson. Mechanics and Thermodynamics of Propulsion. Upper Saddle River, NJ: Prentice Hall, 1991. ISBN: 0201146592.\nRohsenow, Warren, James Hartnett, and Young Cho. Handbook of Heat Transfer. New York, NY: McGraw-Hill, 1998. ISBN: 0070535558.\nMcAdams, William Henry. Heat Transmission. Melbourne, FL: Krieger Publishing, 1985, pp. 82-97. ISBN: 0898748763.\nHagemann, Gerald, Hans Immich, Thong Van Nguyen, and Gennady Dumnov. \u0026ldquo;Advanced Rocket Nozzles.\u0026rdquo; Journal of Propulsion and Power 14, no. 5 (September-October 1998).\nSirignano, William. \u0026ldquo;Current Status of Spray Combustion Modelling.\u0026rdquo; 39th AIAA/ASME/SAE/ASEE Joint Propulsion Conference, Huntsville, Alabama, July 20-23 2003.\nLEC # TOPICS 1 Introduction (PDF) 2 Rocket Nozzles and Thrust (PDF) 3 Ideal Nozzle Fluid Mechanics (PDF) 4-5 Nozzle Design: Method of Characteristics (PDF) 6 Effects of Particles in Nozzle Flow (PDF) 7 Convective Heat Transfer: Reynolds Analogy (PDF) 8 Convective Heat Transfer: Other Effects (PDF) 9 Liquid Cooling (PDF) 10 Ablative Cooling, Film Cooling (PDF) 11 Radiation Heat Transfer and Cooling (PDF - 1 MB) 12 Review of Equilibrium Thermochemistry (PDF) 13 Examples of Chemical Equilibrium (PDF) 14 Non-Equilibrium Flows (PDF) 15 Selection of Propellant Mixtures (PDF) 16 Solid Propellants: Design Goals and Constraints (PDF) 17-18 Solid Propellants: Other Topics (PDF) 19 Liquid Propellants (PDF) 20 Combustion of Liquid Propellants (PDF) 21 Liquid Motors: Injection and Mixing (PDF) 22 Liquid Motors: Stability (Low Frequency) (PDF) 23 Liquid Motors: Stability (High Frequency); Acoustics (PDF) 24 Pressurization and Pump Cycles (PDF) 25 Basic Turbomachine Performance (PDF) 26 Turbopumps (PDF) 27 Turbines (PDF) 28 Mechanical Design of Turbomachinery (PDF) 29 Rotordynamics Problems (PDF) 30 Dynamics of Turbopump Systems: The Shuttle Engine (PDF) 31 Active Control of Rockets 32 Orbital Mechanics: Review, Staging (PDF) 33 Performance to LEO (PDF) 34 Performance to GEO (PDF) 35-36 Impulsive and Low-Thrust Maneuvers in Space (PDF) 37 Future Developments (PDF) "}


